		Если УжеДобавлены.Получить(СтрокаКандидата.Контрагент) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		УжеДобавлены.Вставить(СтрокаКандидата.Контрагент, Истина);
		Контрагенты.Добавить(СтрокаКандидата.Контрагент);
		ИдентификаторыУчастниковЭДО.Добавить(СтрокаКандидата.ИдентификаторУчастникаЭДО);
		BoxIds.Добавить(СтрокаКандидата.BoxId);

		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("Контрагент", СтрокаКандидата.Контрагент);
		ДанныеСтроки.Вставить("ИНН", СтрокаКандидата.ИНН);
		ДанныеСтроки.Вставить("КПП", СтрокаКандидата.КПП);
		ДанныеСтроки.Вставить("ИдентификаторУчастникаЭДО", СтрокаКандидата.ИдентификаторУчастникаЭДО);
		ДанныеСтроки.Вставить("ИдЭДО", СтрокаКандидата.ИдентификаторУчастникаЭДО);
		ДанныеСтроки.Вставить("ИдентификаторКонтрагентаЭДО", СтрокаКандидата.ИдентификаторУчастникаЭДО);
		ДанныеСтроки.Вставить("BoxId", СтрокаКандидата.BoxId);
		ДанныеСтроки.Вставить("ИдентификаторЯщика", СтрокаКандидата.BoxId);
		ДанныеСтроки.Вставить("КодОператораЭДО", "2BM");
		ДанныеКонтрагентов.Добавить(ДанныеСтроки);
	КонецЦикла;

	Возврат Новый Структура(
		"Контрагенты,ДанныеКонтрагентов,ИдентификаторыУчастниковЭДО,BoxIds",
		Контрагенты,
		ДанныеКонтрагентов,
		ИдентификаторыУчастниковЭДО,
		BoxIds);

КонецФункции

#КонецОбласти
